/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Telesec-Erweiterung";
"06 06 02 82 06 01 0A 01"		= "Telesec-Mechanismus";

"06 07 02 82 06 01 0A 01 00"	= "Telesec-Authentifizierung";
"06 08 02 82 06 01 0A 01 00 01"	= "Kennwort-Authentifizierung";
"06 08 02 82 06 01 0A 01 00 02" = "Geschützte Kennwort-Authentifizierung";
"06 08 02 82 06 01 0A 01 00 03" = "Einweg-X.509-Authentifizierung";
"06 08 02 82 06 01 0A 01 00 04" = "Zweiweg-X.509-Authentifizierung";
"06 08 02 82 06 01 0A 01 00 05" = "Dreiweg-X.509-Authentifizierung";
"06 08 02 82 06 01 0A 01 00 06" = "Einweg-ISO9798-Authentifizierung";
"06 08 02 82 06 01 0A 01 00 07" = "Zweiweg-ISO9798-Authentifizierung";
"06 08 02 82 06 01 0A 01 00 08" = "Telekom-Authentifizierung";

"06 07 02 82 06 01 0A 01 01"	= "Telesec-Signatur";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 mit RSA und ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 mit RSA und Telesec Signatur-Standard";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 mit RSA und ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 mit RSA und Telesec Signatur-Standard";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 mit RSA und Telekom Signatur-Standard";
"06 08 02 82 06 01 0A 01 01 09"	= "HBCI RSA-Signatur";

"06 07 02 82 06 01 0A 01 02"	= "Telesec-Verschlüsselung";
"06 08 02 82 06 01 0A 01 02 00"	= "Ohne";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Einweg-Funktion";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hash mithilfe von Block-Cipher";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "FEC-Funktion";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Telesec-Modul";
"06 07 02 82 06 01 0A 02 00"	= "Algorithmen";
"06 07 02 82 06 01 0A 02 01"	= "Attributtypen";
"06 07 02 82 06 01 0A 02 02"	= "Zertifikatstypen";
"06 07 02 82 06 01 0A 02 03"	= "Nachrichtentypen";
"06 07 02 82 06 01 0A 02 04"	= "PL-Protokoll";
"06 07 02 82 06 01 0A 02 05"	= "SME und Komponenten von SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Nützliche Definitionen";
"06 07 02 82 06 01 0A 02 08"	= "STE-Dateien";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Elektronische Anforderung";
"06 07 02 82 06 01 0A 02 0B"	= "Telesec TTP Asymmetrisches Programm";
"06 07 02 82 06 01 0A 02 0C"	= "Telesec TTP Standardprogramm";
"06 07 02 82 06 01 0A 02 0D"	= "Telesec TTP-Nachrichten";
"06 07 02 82 06 01 0A 02 0E"	= "Telesec TTP Zeitmarkenprogramm";

"06 06 02 82 06 01 0A 03"		= "Objektklasse";
"06 07 02 82 06 01 0A 03 00"	= "Telesec: anderer Name";
"06 07 02 82 06 01 0A 03 01"	= "Verzeichnis";
"06 07 02 82 06 01 0A 03 02"	= "Verzeichnistyp";
"06 07 02 82 06 01 0A 03 03"	= "Verzeichnisgruppe";
"06 07 02 82 06 01 0A 03 04"	= "Verzeichnisbenutzer";
"06 07 02 82 06 01 0A 03 05"	= "Symmetrischer Schlüsseleintrag";

"06 06 02 82 06 01 0A 04"		= "Paket";
"06 06 02 82 06 01 0A 05"		= "Parameter";
"06 06 02 82 06 01 0A 06"		= "Name Binding";
"06 06 02 82 06 01 0A 07"		= "Kriterium";
"06 07 02 82 06 01 0A 07 00"	= "App-Gruppenidentifizierung";
"06 07 02 82 06 01 0A 07 01"	= "Zertifikatstyp";
"06 07 02 82 06 01 0A 07 02"	= "Telesec-Zertifikat";
"06 07 02 82 06 01 0A 07 03"	= "Zertifikatsnummer";
"06 07 02 82 06 01 0A 07 04"	= "Liste für Zertifikatswiderrufung";
"06 07 02 82 06 01 0A 07 05"	= "Erstellungsdatum";
"06 07 02 82 06 01 0A 07 06"	= "Aussteller";
"06 07 02 82 06 01 0A 07 07"	= "Namensvergebungsstelle";
"06 07 02 82 06 01 0A 07 08"	= "Verzeichnis für öffentliche Schlüssel";
"06 07 02 82 06 01 0A 07 09"	= "Sicherheits-Domain";
"06 07 02 82 06 01 0A 07 0A"	= "Betreff";
"06 07 02 82 06 01 0A 07 0B"	= "Zeit der Widerrufung";
"06 07 02 82 06 01 0A 07 0C"	= "Benutzergruppen-Referenz";
"06 07 02 82 06 01 0A 07 0D"	= "Gültigkeit";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Security Message Environment";
"06 07 02 82 06 01 0A 07 10"	= "Anonymes Verzeichnis für öffentlichen Schlüssel";
"06 07 02 82 06 01 0A 07 11"	= "Telesec: Vorname";
"06 07 02 82 06 01 0A 07 12"	= "Namenszusätze";
"06 07 02 82 06 01 0A 07 13"	= "Telesec: Postleitzahl";
"06 07 02 82 06 01 0A 07 14"	= "Namensdifferenzierung";
"06 07 02 82 06 01 0A 07 15"	= "Telesec-Zertifikatsliste";
"06 07 02 82 06 01 0A 07 16"	= "Teletrust-Zertifikatsliste";
"06 07 02 82 06 01 0A 07 17"	= "X.509-Zertifikatsliste";
"06 07 02 82 06 01 0A 07 18"	= "Ausstellungszeit";
"06 07 02 82 06 01 0A 07 19"	= "Physikalische Kartennummer";
"06 07 02 82 06 01 0A 07 1A"	= "Dateityp";
"06 07 02 82 06 01 0A 07 1B"	= "Ctl-Datei ist ein Archiv";
"06 07 02 82 06 01 0A 07 1C"	= "E‑Mail-Adresse";
"06 07 02 82 06 01 0A 07 1D"	= "Liste für Zertifikatsvorlage";
"06 07 02 82 06 01 0A 07 1E"	= "Ordner-Name";
"06 07 02 82 06 01 0A 07 1F"	= "Name des Verzeichnistyps";
"06 07 02 82 06 01 0A 07 20"	= "Verzeichnis-Gruppenname";
"06 07 02 82 06 01 0A 07 21"	= "Verzeichnis-Benutzername";
"06 07 02 82 06 01 0A 07 22"	= "Widerrufungsmarkierung";
"06 07 02 82 06 01 0A 07 23"	= "Symmetrischer Schlüsseleintragsname";
"06 07 02 82 06 01 0A 07 24"	= "GL-Nummer";
"06 07 02 82 06 01 0A 07 25"	= "GO-Nummer";
"06 07 02 82 06 01 0A 07 26"	= "G-Schlüsseldaten";
"06 07 02 82 06 01 0A 07 27"	= "Z-Schlüsseldaten";
"06 07 02 82 06 01 0A 07 28"	= "KT-Schlüsseldaten";
"06 07 02 82 06 01 0A 07 2A"	= "KT-Schlüsselnummer";
"06 07 02 82 06 01 0A 07 33"	= "Zeit der Widerrufungsgenerierung";
"06 07 02 82 06 01 0A 07 34"	= "Haftungstext";

"06 06 02 82 06 01 0A 08"		= "Attributgruppe";
"06 06 02 82 06 01 0A 09"		= "Aktion";
"06 06 02 82 06 01 0A 0A"		= "Mitteilung";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Sicherheits-App";

"06 06 02 82 06 01 0A 0C"		= "Definitionen der Zertifikats- und CRL-Erweiterung";

"06 07 02 82 06 01 0A 0C 00"	= "Zertifikatserweiterung: Erweiterung der Haftungsbeschränkung";
"06 07 02 82 06 01 0A 0C 01"	= "Erweiterung der Telesec Zertifikats-ID";
"06 07 02 82 06 01 0A 0C 02"	= "Telesec-Richtlinien: Identifizierung";
"06 07 02 82 06 01 0A 0C 03"	= "Telesec-Richtilinien: Qualifier-ID";
"06 07 02 82 06 01 0A 0C 04"	= "Telesec CRL-gefilterte Erweiterung";
"06 07 02 82 06 01 0A 0C 05"	= "Telesec CRL-Filter Erweiterung";
"06 07 02 82 06 01 0A 0C 06"	= "Erweiterung der Telesec Namensvergebungsstelle";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "Benutzer-ID";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "RFC822-Postfach";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Domain-Komponente";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Australische Firmennummer";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Certificates Australia: Richtlinienidentifizierung";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet Personal";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet Business";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet Legal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Signet Policy Identifier";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Symmetrischer Verschlüsselungsalgorithmus";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "SEIS Hochsicherheits-Richtlinienidentifizierung";
"06 06 2A 85 70 22 01 02"	= "SEIS GAK Richtlinienidentifizierung";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "SEIS AT Persönliche Identifizierung";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "ANSI X9.57-Modul";
"06 07 2A 86 48 CE 38 01 01"	= "X9F1-Zertifikatsverwaltung";
"06 06 2A 86 48 CE 38 02"		= "Hold Instruction";
"06 07 2A 86 48 CE 38 02 01"	= "Hold Instruction-None";
"06 07 2A 86 48 CE 38 02 02"	= "Anrufer";
"06 07 2A 86 48 CE 38 02 03"	= "Ablehnen";
"06 07 2A 86 48 CE 38 02 04"	= "Abheben";
"06 06 2A 86 48 CE 38 03"		= "Kriterium";
"06 06 2A 86 48 CE 38 03 01"	= "Gegensignatur";
"06 06 2A 86 48 CE 38 03 02"	= "Attributzertifikat";
"06 06 2A 86 48 CE 38 04"		= "Algorithmus";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA-Übereinstimmung";
"06 07 2A 86 48 CE 38 04 03"	= "DSA mit SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "ANSI X9.62-Feldtyp";
"06 07 2A 86 48 CE 3D 01 01"	= "Hauptfeld";
"06 07 2A 86 48 CE 3D 01 02"	= "Characteristic-Two Field";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Characteristic-Two Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Null-Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Trinom-Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Pentanom-Basis";
"06 06 2A 86 48 CE 3D 02"		= "Öffentlicher Schlüsseltyp";
"06 07 2A 86 48 CE 3D 02 01"	= "Elliptic Curve Public Key";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "ANSI X9.42-Feldtyp";
"06 07 2A 86 48 CE 3E 01 01"	= "Galois-Hauptfeld";
"06 06 2A 86 48 CE 3E 02"		= "Nummerart";
"06 07 2A 86 48 CE 3E 02 01"	= "Diffie-Hellman öffentlicher Schlüssel";
"06 06 2A 86 48 CE 3E 03"		= "Schema";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman Statisch";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman Ephemeral";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman Hybrid 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman Hybrid 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Versionsinformation anvertrauen";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE mit MD5 und CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "Kennwort-basiertes MAC";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Benutzer vertrauen";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "CA-Information vertrauen";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Attributzertifikat";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "RSA-Verschlüsselung";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 mit RSA-Verschlüsselung";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 mit RSA-Verschlüsselung";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 mit RSA-Verschlüsselung";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 mit RSA-Verschlüsselung";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "RSA-OAEP-Verschlüsselung (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "RSA-OAEP-Verschlüsselung";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "RSA-OAEP Label Specified";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "RSA-PSS Signaturschema";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 mit RSA-Verschlüsselung";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 mit RSA-Verschlüsselung";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 mit RSA-Verschlüsselung";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 mit RSA-Verschlüsselung";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "BSAFE RSA-Verschlüsselung";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Diffie-Hellman Schlüssel-Vereinbarung";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE mit MD2 und DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE mit MD5 und DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE mit MD2 und RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE mit MD5 und RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE mit MD5 und XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE mit SHA und DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Daten";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Signierte Daten";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Eingepackte Daten";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Signierte und eingepackte Daten";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Gebündelte Daten";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Verschlüsselte Daten";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Daten mit Attributen";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Verschlüsselte Informationen zum privaten Schlüssel";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "E‑Mail-Adresse";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Unstrukturierter Name";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Art des Inhalts";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Gebündelte Nachricht";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Zeitpunkt der Signatur";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Gegensignatur";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Kennwort anfordern";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Unstrukturierte Adresse";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Erweiterte Zertifikatsattribute";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Aussteller und Seriennummer";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Kennwort überprüfen";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Öffentlicher Schlüssel";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Signatur-Beschreibung";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Erweiterungsanfrage";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "S/MIME-Fähigkeiten";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Signierte Daten bevorzugen";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Nichts kann entschlüsselt werden";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Beleganfrage";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Beleg";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Inhaltshinweise";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Verlauf zur Erweiterung der E‑Mail-Liste";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "S/MIME-Module";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Kryptografische Nachrichtensyntax";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Verbesserte Sicherheitsdienste";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "S/MIME-Objektidentifizierung";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "S/MIME V3-Nachricht";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "ETS Elektronische Signatur 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "ETS Elektronische Signatur 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "ETS Richtlininen zur elektronischen Signatur 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "ETS Richtlininen zur elektronischen Signatur 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "S/MIME-Inhaltstypen";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "S/MIME Authentifizierte Attribute";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "S/MIME-Algorithmen";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Verteilung der S/MIME-Zertifikate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Verteilung der LDAP-Zertifikate";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "S/MIME-Signaturrichtlinien";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "S/MIME Signaturtyp-ID";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Absendersignatur";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Domain-Signatur";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Signatur der zusätzlichen Attribute";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Prüfungssignatur";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "S/MIME-Fähigkeiten";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Prefer Binary Inside";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Lesbarer Name (für PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "Lokale Schlüssel-ID (für PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Zertifikatstypen (für PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "X.509-Zertifikate (für PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "SDSI-Zertifikate (für PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "CRL-Typen (für PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (für PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "PKCS-12 Syntax zum Austauschen persönlicher Informationen";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "PKCS-12 Kennwort-basierte Verschlüsselungs-IDs";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE mit SHA-1 und 128-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE mit SHA-1 und 40-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE mit SHA-1 und 3-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE mit SHA-1 und 2-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE mit SHA-1 und 128-Bit RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE mit SHA-1 und 40-Bit RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK IDs";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "PKCS-12 PKCS-8 Key Shrouding";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12 Bag-IDs";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "PKCS-12 Schlüssel-Bag-ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "PKCS-12 Zertifikats- und CRL-Bag-ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "PKCS-12 geheime Bag-ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "PKCS-12 ID für sicheren Inhalt";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "PKCS-12 PKCS-8 Shrouded Schlüssel-Bag-ID";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "PKCS-12 Zertifikats-Bag-ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "PKCS-12 X.509 Zertifikats- und CRL-Bag-ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "PKCS-12 SDSI Zertifikats-Bag-ID";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "PKCS-12 Kennwort-basierte Verschlüsselungs-ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE mit SHA-1 und 128-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE mit SHA-1 und 40-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE mit SHA-1 und Triple DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE mit SHA-1 und 128-Bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE mit SHA-1 und 40-Bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE mit SHA-1 und RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE mit SHA-1 und RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "PKCS-12 IDs für das Einpacken";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "PKCS-12 RSA-Verschlüsselung mit 128-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "PKCS-12 RSA-Verschlüsselung mit 40-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "PKCS-12 RSA-Verschlüsselung mit Dreifach DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "PKCS-12 Signatur-ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "PKCS-12 RSA-Signatur mit SHA-1 Digest";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 Version 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "PKCS-12 Bag-IDs";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "PKCS-12 Schlüssel-Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "PKCS-12 PKCS-8 Shrouded Schlüssel-Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "PKCS-12 Zertifikats-Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "PKCS-12 CRL-Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "PKCS-12 Geheime Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "PKCS-12 Bag mit sicherem Inhalt";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "PKCS-15 Module";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "PKCS-15 Attribute";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "PKCS-15 Inhaltstyp";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "PKCS-15 Inhalt";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "RSADSI Digest Algorithmus";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC mit SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "RSADSI-Verschlüsselungsalgorithmus";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 mit MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identrus-Identifizierung: unbekannte Richtlinie";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus-OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT Benutzer-zu-Benutzer Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Microsoft Exchange Server-Objektklasse";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Site-Adressvergabe";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Klassenschema";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Attributschema";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Postfach-Agent";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Postfach";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Container";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "E‑Mail-Empfänger";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Liefermechanismus";

"06 07 2A 86 48 86 F7 14 04"				= "Microsoft Dateiformate";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Projekt";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authentifizierungscode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "SPC Indirekter Datenkontext";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "SPC-Agenturinformation";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "SPC-Aussagetyp";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "SPC-Opusinformation";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "SPC-Zertifikatserweiterungen";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "SPC PE-Image-Daten";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPC-Link (Typ 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Eigene Code-Signierung";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Kommerzielle Code-Signierung";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPC-Link (Typ 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "SPC Minimale Kriterien";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "SPC Finanzielle Kriterien";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPC-Link (Typ 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "NTLM Sicherheits-Support Provider";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Zeitmarken-Gegensignatur";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Liste für vertrauenswürdige Zertifikate";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Sortierte CTL-Erweiterung";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Ort des nächsten Update";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Verbesserte Schlüsselverwendung";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Signierung der Liste für vertrauenswürdige Zertifikate";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Signierung der Zeitmarke";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Server Gated Crypto";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Serialisierte Verschlüsselung";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Verschlüsselte Dateisysteme";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Wiederherstellung verschlüsselter Dateisysteme";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Windows-Hardware kompatibel";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "NT5-Signierung";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Windows-Hardware OEM-Signierung";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Eingebettete NT-Signierung";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Signierung der vertrauenswürdigen Root-Liste";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Qualifizierte Unterordnung";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Schlüsselwiederherstellung";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Dokumentsignierung";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Attribut-Objektidentifizierung";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Ja/Nein-Vertrauensattribut";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Musik-DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft DRM-Individualisierung";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Microsoft Lizenzen";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Microsoft Lizenz-Server";

"06 08 2B 06 01 04 01 82 37 0D"				= "Microsoft PKCS-10 Objektidentifizierung";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Erneuerungszertifikat";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Registrierungsname/Wertepaar";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "Registrierungs-CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "OS-Version";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Microsoft PKCS-12 Attribute";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Schlüsselset des lokalen Rechners";

"06 08 2B 06 01 04 01 82 37 14"				= "Microsoft Registrierungsinfrastruktur";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Automatische Registrierungs CTL-Verwendung";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Registrierungs-Zertifikatstyp";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Registrierungs-Agent";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Smartcard Anmeldung";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "NT Benutzeranmeldename";

"06 08 2B 06 01 04 01 82 37 15"				= "Microsoft Certificate Serverinfrastruktur";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Microsoft CA-Veränderungsversion";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "CAPICOM-Version";
"06 09 2B 06 01 04 01 82 37 58 02"			= "CAPICOM-Attribut";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Dokumentname";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Dokumentbeschreibung";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Verschlüsselte Daten";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Verschlüsselter Inhalt";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "UNINETT-Richtlinien Identifizierung";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "ICE-TEL Richtlinienidentifizierung";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "ICE-TEL CA-Richtlinien Identifizierung";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal mit SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal mit RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "cryptlib Attribute";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "cryptlib: Vorhandensein prüfen";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP Response RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "OCSP Response RTCS Erweitert";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "CRL Extended Reason";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Schlüsselfunktionen";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI-Boot";
"06 09 2B 06 01 04 01 97 55 04 01"			= "cryptlib: Inhalt";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "cryptlib: Konfigurationsdaten";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "cryptlib: Benutzerindex";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "cryptlib: Benutzerinformation";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "XYZZY-Richtlinien Identifizierung";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Timeproof";
"06 08 2B 06 01 04 01 AA 60 01"		= "Zeitsignatur-System";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Zeitsignatur-System 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Zeitsignatur-System 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Zeitsignatur-System 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Sekundäre Verfahren";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Physikalische IDs";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos-PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Kerberos-Authentifizierungsdaten";
"06 07 2B 06 01 05 02 03 02"        = "Daten des Kerberos-Diffie-Hellman-Schlüssels";
"06 07 2B 06 01 05 02 03 03"        = "Daten des Kerberos-Antwortschlüssels";
"06 07 2B 06 01 05 02 03 04"        = "Kerberos-Clientauthentifizierung";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos-KDC (Key Distribution Center)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "SPKM (Simple Public Key Mechanism)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Public Key Infrastructure";

"06 07 2B 06 01 05 05 07 01"		= "PKIX Private Zertifikatserweiterung";
"06 08 2B 06 01 05 05 07 01 01"		= "Zugriff auf Informationen bei der Zertifizierungsinstanz";
"06 08 2B 06 01 05 05 07 01 02"		= "Biometrische Informationen";
"06 08 2B 06 01 05 05 07 01 03"		= "Qualified Certificate Anweisungen";
"06 08 2B 06 01 05 05 07 01 04"		= "Attributszertifikat Audit-Identität";
"06 08 2B 06 01 05 05 07 01 05"		= "Ausrichtung des Attributzertifikats";
"06 08 2B 06 01 05 05 07 01 06"		= "Attribut-Zertifizierungsinstanz Steuerungen";
"06 08 2B 06 01 05 05 07 01 07"		= "SBGP IP-Adressblock";
"06 08 2B 06 01 05 05 07 01 08"		= "SBGP Identifizierung eines autonomen Systems";
"06 08 2B 06 01 05 05 07 01 09"		= "SBGP Router-Identifizierung";
"06 08 2B 06 01 05 05 07 01 0A"		= "Attributzertifikat Proxying";
"06 08 2B 06 01 05 05 07 01 0B"		= "Subject Information Access";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotyp";

"06 07 2B 06 01 05 05 07 02"		= "Typen der Richtlinienkennzeichnung";
"06 08 2B 06 01 05 05 07 02 01"		= "Stellungnahme zum Zertifizierungsverfahren";
"06 08 2B 06 01 05 05 07 02 02"		= "Benutzerhinweis";
"06 08 2B 06 01 05 05 07 02 03"		= "Texthinweis";

"06 07 2B 06 01 05 05 07 03"		= "Nutzen des Schlüssel";
"06 08 2B 06 01 05 05 07 03 01"		= "Serverauthentifizierung";
"06 08 2B 06 01 05 05 07 03 02"		= "Clientauthentifizierung";
"06 08 2B 06 01 05 05 07 03 03"		= "Code-Signierung";
"06 08 2B 06 01 05 05 07 03 04"		= "E‑Mail-Schutz";
"06 08 2B 06 01 05 05 07 03 05"		= "IPSEC-Endsystem";
"06 08 2B 06 01 05 05 07 03 06"		= "IPSEC-Tunnel";
"06 08 2B 06 01 05 05 07 03 07"		= "IPSEC-Benutzer";
"06 08 2B 06 01 05 05 07 03 08"		= "Zeitmarke";
"06 08 2B 06 01 05 05 07 03 09"		= "OCSP-Signierung";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "SBGP AA Serverauthentifizierung";

"06 07 2B 06 01 05 05 07 04"		= "CMP-Informationsarten";
"06 08 2B 06 01 05 05 07 04 01"		= "CA Protokoll Verschlüsselungszertifikat";
"06 08 2B 06 01 05 05 07 04 02"		= "Schlüsselpaartypen signieren";
"06 08 2B 06 01 05 05 07 04 03"		= "Art der Verschlüsselungspaare";
"06 08 2B 06 01 05 05 07 04 04"		= "Bevorzugter symmetrischer Algorithmus";
"06 08 2B 06 01 05 05 07 04 05"		= "CA-Schlüssel Update-Infomation";
"06 08 2B 06 01 05 05 07 04 06"		= "Aktuelles CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "Nicht unterstützte OIDs";
"06 08 2B 06 01 05 05 07 04 08"		= "Abonnementanfrage";
"06 08 2B 06 01 05 05 07 04 09"		= "Abonnementantwort";
"06 08 2B 06 01 05 05 07 04 0A"		= "Schlüsselpaar Parameteranfrage";
"06 08 2B 06 01 05 05 07 04 0B"		= "Schlüsselpaar Parameterantwort";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "CRMF-Registrierung";
"06 08 2B 06 01 05 05 07 05 01"		= "Registrierungssteuerung";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Registrierungs-Token";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Authentifizierung";
"06 09 2B 06 01 05 05 07 05 01 03"	= "PKI-Publizierungsinformation";
"06 09 2B 06 01 05 05 07 05 01 04"	= "PKI-Archivoptionen";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Alte Zertifikats-ID";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Protokollverschlüsselungsschlüssel";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Alternative Zertifikatsvorlage";
"06 09 2B 06 01 05 05 07 05 01 08"	= "WAP WTLS-Vorlage";

"06 08 2B 06 01 05 05 07 05 02"		= "CRMF-Registrierungsinformation";
"06 09 2B 06 01 05 05 07 05 02 01"	= "UTF-8 Paare";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Zertifikatsanforderung";

"06 07 2B 06 01 05 05 07 06"		= "Algorithmen";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Keine Signatur";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "CMC-Steuerungen";

"06 07 2B 06 01 05 05 07 08"		= "Andere Namen";
"06 08 2B 06 01 05 05 07 08 01"		= "Persönliche Daten";
"06 08 2B 06 01 05 05 07 08 02"		= "Benutzergruppe";

"06 07 2B 06 01 05 05 07 09"		= "Persönliche Daten";
"06 08 2B 06 01 05 05 07 09 01"		= "Geburtsdatum";
"06 08 2B 06 01 05 05 07 09 02"		= "Geburtsort";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudonym";
"06 08 2B 06 01 05 05 07 09 04"		= "Geschlecht";
"06 08 2B 06 01 05 05 07 09 05"		= "Staatsangehörigkeit (Land)";
"06 08 2B 06 01 05 05 07 09 06"		= "Wohnort (Land)";

"06 07 2B 06 01 05 05 07 0A"		= "Attributzertifikat";
"06 08 2B 06 01 05 05 07 0A 01"		= "Authentifizierungsinformation";
"06 08 2B 06 01 05 05 07 0A 02"		= "Zugriffsidentität";
"06 08 2B 06 01 05 05 07 0A 03"		= "Identität wird geladen";
"06 08 2B 06 01 05 05 07 0A 04"		= "Gruppe";
"06 08 2B 06 01 05 05 07 0A 05"		= "Funktion";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "OCSP-Protokoll (Online Certificate Status)";
"06 09 2B 06 01 05 05 07 30 01 01"	= "OCSP-Standardantwort";
"06 09 2B 06 01 05 05 07 30 01 02"	= "OCSP Nonce-Erweiterung";
"06 09 2B 06 01 05 05 07 30 01 03"	= "OCSP CRL-Referenz";
"06 09 2B 06 01 05 05 07 30 01 04"	= "OCSP-Antwort";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP No Revocation Check";
"06 09 2B 06 01 05 05 07 30 01 06"	= "OCSP Archive Cutoff";
"06 09 2B 06 01 05 05 07 30 01 07"	= "OCSP Service Locator";

"06 08 2B 06 01 05 05 07 30 02"		= "CA-Aussteller";
"06 08 2B 06 01 05 05 07 30 03"		= "Zeitmarke";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE Zwischenstufe";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "DEC-Verschlüsselungsalgorithmus";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "DEC-Hash-Algorithmus";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "DEC-Signaturalgorithmus";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 mit RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 mit RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 mit RSA";
"06 05 2B 0E 03 02 03"				= "MD5 mit RSA";
"06 05 2B 0E 03 02 04"				= "MD4 mit RSA-Verschlüsselung";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N mit RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "RSA-Signatur";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA mit SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 mit RSA-Signatur";
"06 05 2B 0E 03 02 0F"				= "SHA mit RSA-Signatur";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman mit Common Modulus";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA Common";
"06 05 2B 0E 03 02 15"				= "DSA Common mit SHA";
"06 05 2B 0E 03 02 16"				= "RSA-Schlüsseltransport";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 mit RSA-Signatur";
"06 05 2B 0E 03 02 19"				= "MD5 mit RSA-Signatur";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA mit SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA mit Common SHA-1";
"06 05 2B 0E 03 02 1D"				= "SHA-1 mit RSA-Verschlüsselung";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 mit RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 mit ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Dokument";
"06 04 2B 24 01 01"					= "Finale Version";
"06 04 2B 24 01 02"					= "Entwurf";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algorithmus";
"06 04 2B 24 03 01"					= "Verschlüsselungsalgorithmus";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "RSA-Verschlüsselung";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Hash-Algorithmus";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 einfache Länge";
"06 05 2B 24 03 02 05"				= "MDC2 doppelte Länge";
"06 04 2B 24 03 03"					= "Signatur-Algorithmus";
"06 05 2B 24 03 03 01"				= "RSA-Signatur";

"06 06 2B 24 03 03 01 01"			= "RSA-Signatur mit SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "RSA-Signatur mit SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "RSA-Signatur mit SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "RSA-Signatur mit SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "RSA-Signatur mit SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "RSA-Signatur mit SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "RSA-Signatur mit SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "RSA-Signatur mit SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "RSA-Signatur mit SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "RSA-Signatur mit SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "RSA-Signatur mit SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "RSA-Signatur mit SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "RSA-Signatur mit SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "RSA-Signatur mit SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "RSA-Signatur mit SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "RSA-Signatur mit SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "RSA-Signatur mit SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "RSA-Signatur mit SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "RSA-Signatur mit SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "RSA-Signatur mit SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "RSA-Signatur mit SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "RSA-Signatur mit SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "RSA-Signatur mit SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "RSA-Signatur mit SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "RSA-Signatur mit SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "RSA-Signatur mit SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "RSA-Signatur mit RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "RSA-Signatur mit RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "RSA-Signatur mit RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "RSA-Signatur mit RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "RSA-Signatur mit RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "RSA-Signatur mit RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "RSA-Signatur mit RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "RSA-Signatur mit RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "RSA-Signatur mit RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "RSA-Signatur mit RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "RSA-Signatur mit RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "RSA-Signatur mit RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "RSA-Signatur mit RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "RSA-Signatur mit RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "RSA-Signatur mit RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "RSA-Signatur mit RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "RSA-Signatur mit RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "RSA-Signatur mit RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "RSA-Signatur mit RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "RSA-Signatur mit RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "RSA-Signatur mit RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "RSA-Signatur mit RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "RSA-Signatur mit RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "RSA-Signatur mit RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "RSA-Signatur mit RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "RSA-Signatur mit RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "RSA-Signatur mit RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "RSA-Signatur mit RIPEMD-256";

"06 05 2B 24 03 03 02"				= "ECSIE-Signatur";
"06 06 2B 24 03 03 02 01"			= "ECSIE-Signatur mit SHA-1";
"06 06 2B 24 03 03 02 02"			= "ECSIE-Signatur mit RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "ECSIE-Signatur mit MD2";
"06 06 2B 24 03 03 02 04"			= "ECSIE-Signatur mit MD5";

"06 04 2B 24 03 04"					= "Signaturschema";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 mit RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 mit RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 mit RND";

"06 03 2B 24 04"					= "Kriterium";
"06 03 2B 24 05"					= "Richtlinie";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "Hersteller-spezifisches API";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "Funktionalitäts-spezifisches API";
"06 03 2B 24 07"					= "Schlüsselverwaltung";
"06 04 2B 24 07 01"					= "Schlüssel-Vereinbarung";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Schlüsselübertragung";
"06 05 2B 24 07 02 01"				= "ISO9796-2 mit RSA-Verschlüsselung";

"06 05 2B 24 08 01 01"				= "Teletrust SigiSigConform Richtlinienidentifizierung";
"06 05 2B 24 08 02 01"				= "Verzeichnisdienst";

"06 05 2B 24 08 03 01"				= "Datum der Zertifikatsgeneration";
"06 05 2B 24 08 03 02"				= "Vollmacht";
"06 05 2B 24 08 03 03"				= "Erlaubnis";
"06 05 2B 24 08 03 04"				= "Finanzielle Grenze";
"06 05 2B 24 08 03 05"				= "Mehrheitserklärung";
"06 05 2B 24 08 03 06"				= "Seriennummer der Karte mit integrierten Schaltungen";
"06 05 2B 24 08 03 07"				= "Referenz des öffentlichen Schlüssels";
"06 05 2B 24 08 03 08"				= "Einschränkung";
"06 05 2B 24 08 03 09"				= "Abrufen (falls zulässig)";
"06 05 2B 24 08 03 0A"				= "Angefordertes Zertifikat";
"06 05 2B 24 08 03 0B"				= "Namensvergebungsstelle";
"06 05 2B 24 08 03 0C"				= "Zertifikat im Verzeichnis seit";
"06 05 2B 24 08 03 0D"				= "Zertifikats-Hash";

"06 05 2B 24 08 04 01"				= "Persönliche Daten";
"06 05 2B 24 08 04 08"				= "Einschränkung";
"06 07 2B 24 08 05 01 01 01"		= "RSA Indicate SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA Indicate RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA mit SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA mit RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA Erweitert";
"06 07 2B 24 08 05 01 02 02"		= "DSA mit RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Zertifikat";
"06 05 2B 24 08 06 02"				= "Zertifikatsreferenz";
"06 05 2B 24 08 06 03"				= "Attributzertifikat";
"06 05 2B 24 08 06 04"				= "Attributreferenz";
"06 05 2B 24 08 06 05"				= "Dateiname";
"06 05 2B 24 08 06 06"				= "Speicherzeit";
"06 05 2B 24 08 06 07"				= "Dateigröße";
"06 05 2B 24 08 06 08"				= "Ortungsdienste";
"06 05 2B 24 08 06 09"				= "Signaturnummer";
"06 05 2B 24 08 06 0A"				= "Automatisch erzeugt";

"06 05 2B 24 08 07 01"				= "Teletrust Präsentationsarten";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binär";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "MMS";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Thawte-Zertifikatserweiterung";
"06 05 2B 65 01 04 01"				= "Stark geschütztes Extranet";

/* X.520 */

"06 02 55 04"		= "X.520-Attributtypen";
"06 03 55 04 00"	= "Objektklasse";
"06 03 55 04 01"	= "Verknüpfter Eintragsname";
"06 03 55 04 02"	= "Knowledge-Information";
"06 03 55 04 03"	= "Allgemeiner Name";
"06 03 55 04 04"	= "Nachname";
"06 03 55 04 05"	= "Seriennummer";
"06 03 55 04 06"	= "Ländername";
"06 03 55 04 07"	= "Ortsname";
"06 04 55 04 07 01"	= "Gemeinsamer Ortsname";
"06 03 55 04 08"	= "Bundeslands- oder Bezirksname";
"06 04 55 04 08 01"	= "Gemeinsamer Bundeslands- oder Bezirksname";
"06 03 55 04 09"	= "Straße";
"06 04 55 04 09 01"	= "Gemeinsame Straßenadresse";
"06 03 55 04 0A"	= "Firmenname";
"06 04 55 04 0A 01"	= "Gemeinsamer Firmenname";
"06 03 55 04 0B"	= "Name der Organisationseinheit";
"06 04 55 04 0B 01"	= "Gemeinsamer Name der Organisationseinheit";
"06 03 55 04 0C"	= "Titel";
"06 03 55 04 0D"	= "Beschreibung";
"06 03 55 04 0E"	= "Suchhilfe";
"06 03 55 04 0F"	= "Unternehmenskategorie";
"06 03 55 04 10"	= "Postadresse";
"06 04 55 04 10 01"	= "Gemeinsame Postadresse";
"06 03 55 04 11"	= "PLZ";
"06 04 55 04 11 01"	= "Gemeinsame Postleitzahl";
"06 03 55 04 12"	= "Postfach";
"06 04 55 04 12 01"	= "Gemeinsames Postfach";
"06 03 55 04 13"	= "Raumnummer";
"06 04 55 04 13 01"	= "Gemeinsame Raumnummer";
"06 03 55 04 14"	= "Telefonnummer";
"06 04 55 04 14 01"	= "Gemeinsame Telefonnummer";
"06 03 55 04 15"	= "Telex-Nummer";
"06 04 55 04 15 01"	= "Gemeinsame Telex-Nummer";
"06 03 55 04 16"	= "Teletex Terminal-Identifizierung";
"06 04 55 04 16 01"	= "Gemeinsame Teletex Terminal-Identifizierung";
"06 03 55 04 17"	= "Faxnummer";
"06 04 55 04 17 01"	= "Gemeinsame Faxnummer";
"06 03 55 04 18"	= "X.121-Adresse";
"06 03 55 04 19"	= "Internationale ISDN-Nummer";
"06 04 55 04 19 01"	= "Gemeinsame internationale ISDN-Nummer";
"06 03 55 04 1A"	= "Eingetragene Adresse";
"06 03 55 04 1B"	= "Zielanzeige";
"06 03 55 04 1C"	= "Gewünschte Liefermethode";
"06 03 55 04 1D"	= "Darstellungsadresse";
"06 03 55 04 1E"	= "Unterstützter App-Kontext";
"06 03 55 04 1F"	= "Mitglied";
"06 03 55 04 20"	= "Eigentümer";
"06 03 55 04 21"	= "Funktionsinhaber";
"06 03 55 04 22"	= "Siehe auch";
"06 03 55 04 23"	= "Benutzerkennwort";
"06 03 55 04 24"	= "Benutzerzertifikat";
"06 03 55 04 25"	= "CA-Zertifikat";
"06 03 55 04 26"	= "Liste für Befugniswiderrufung";
"06 03 55 04 27"	= "Liste für Zertifikatswiderrufung";
"06 03 55 04 28"	= "Cross-Zertifikatspaar";
"06 03 55 04 29"	= "Name";
"06 03 55 04 2A"	= "Vorname";
"06 03 55 04 2B"	= "Initialien";
"06 03 55 04 2C"	= "Generation Qualifier";
"06 03 55 04 2D"	= "Eindeutige Identifizierung";
"06 03 55 04 2E"	= "DN-Qualifier";
"06 03 55 04 2F"	= "Erweiterte Suchhilfe";
"06 03 55 04 30"	= "Protokollinformation";
"06 03 55 04 31"	= "Name";
"06 03 55 04 32"	= "Eindeutiges Mitglied";
"06 03 55 04 33"	= "Hausidentifizierung";
"06 03 55 04 34"	= "Unterstützte Algorithmen";
"06 03 55 04 35"	= "Liste für Delta-Widerrufung";
"06 03 55 04 36"	= "Klärung";
"06 03 55 04 3A"	= "Cross-Zertifikatspaar";

/* X.500 object classes */

"06 02 55 06"		= "X.520-Objektklasse";
"06 03 55 06 00"	= "Oben";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "Land";
"06 03 55 06 03"	= "Ort";
"06 03 55 06 04"	= "Organisation";
"06 03 55 06 05"	= "Organisationseinheit";
"06 03 55 06 06"	= "Kontakt";
"06 03 55 06 07"	= "Unternehmensperson";
"06 03 55 06 08"	= "Organisatorische Funktion";
"06 03 55 06 09"	= "Gruppe von Namen";
"06 03 55 06 0A"	= "Privatperson";
"06 03 55 06 0B"	= "App-Prozess";
"06 03 55 06 0C"	= "App-Einheit";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Gerät";
"06 03 55 06 0F"	= "Benutzer mit starker Authentifizierung";
"06 03 55 06 10"	= "Zertifizierungsstelle";
"06 03 55 06 11"	= "Gruppe von eindeutigen Namen";
"06 03 55 06 15"	= "PKI-Benutzer";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "X.500-Algorithmen";
"06 03 55 08 01"	= "X.500-Verschlüsselungsalgorithmus";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "X.509-Zertifikatserweiterungen";
"06 03 55 1D 01"	= "Schlüsselkennung (alt)";
"06 03 55 1D 02"	= "Attribute des Hauptschlüssels (alt)";
"06 03 55 1D 03"	= "Zertifikatsrichtlinien (alt)";
"06 03 55 1D 04"	= "Einschränkung der Verwendung des Schlüssels (alt)";
"06 03 55 1D 05"	= "Richtlinienzuordnung (alt)";
"06 03 55 1D 06"	= "Beschränkung der Teilbäume";
"06 03 55 1D 07"	= "Alternativer Name des Inhabers (alt)";
"06 03 55 1D 08"	= "Alternativer Name des Ausstellers (alt)";
"06 03 55 1D 09"	= "Verzeichnisattribute des Inhabers";
"06 03 55 1D 0A"	= "Grundlegende Einschränkungen (2.5.29.10 alt)";
"06 03 55 1D 0B"	= "Namensbeschränkungen (alt)";
"06 03 55 1D 0C"	= "Richtlinienbeschränkungen (alt)";
"06 03 55 1D 0D"	= "Grundlegende Einschränkungen (2.5.29.13 alt)";
"06 03 55 1D 0E"	= "Schlüsselkennung des Antragstellers";
"06 03 55 1D 0F"	= "Schlüsselverwendung";
"06 03 55 1D 10"	= "Verwendungsdauer für den privaten Schlüssel";
"06 03 55 1D 11"	= "Alternativer Name des Inhabers";
"06 03 55 1D 12"	= "Alternativer Name des Ausstellers";
"06 03 55 1D 13"	= "Grundlegende Einschränkungen";
"06 03 55 1D 14"	= "Listennummer für Zertifikatswiderrufung";
"06 03 55 1D 15"	= "Sperrlistengrundcode";
"06 03 55 1D 16"	= "Ablaufdatum (alt)";
"06 03 55 1D 17"	= "Hold Instruction Code";
"06 03 55 1D 18"	= "Ungültig bis";
"06 03 55 1D 19"	= "CRL-Verteilungspunkte (alt)";
"06 03 55 1D 1A"	= "Ausstellender Verteilungspunkt (alt)";
"06 03 55 1D 1B"	= "Delta-CRL-Anzeige";
"06 03 55 1D 1C"	= "Ausstellender Verteilungspunkt";
"06 03 55 1D 1D"	= "Zertifikatsaussteller";
"06 03 55 1D 1E"	= "Namensbeschränkungen";
"06 03 55 1D 1F"	= "CRL-Verteilungspunkte";
"06 03 55 1D 20"	= "Zertifikatsrichtlinien";
"06 04 55 1D 20 00"	= "Beliebige Richtlinienidentifizierung";
"06 03 55 1D 21"	= "Richtlinien zuordnen";
"06 03 55 1D 22"	= "Richtlinienbeschränkungen";
"06 03 55 1D 23"	= "Schlüsselkennung";
"06 03 55 1D 24"	= "Richtlinienbeschränkungen";
"06 03 55 1D 25"	= "Erweiterte Schlüsselverwendung";
"06 04 55 1D 25 00"	= "Beliebige erweiterte Schlüsselverwendung";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "SDNS-Signaturalgorithmus";
"06 09 60 86 48 01 65 02 01 01 02"	= "Fortezza-Signaturalgorithmus";
"06 09 60 86 48 01 65 02 01 01 03"	= "SDNS-Vertraulichkeitsalgorithmus";
"06 09 60 86 48 01 65 02 01 01 04"	= "Fortezza-Vertraulichkeitsalgorithmus";
"06 09 60 86 48 01 65 02 01 01 05"	= "SDNS-Integritätsalgorithmus";
"06 09 60 86 48 01 65 02 01 01 06"	= "Fortezza-Integritätsalgorithmus";
"06 09 60 86 48 01 65 02 01 01 07"	= "SDNS-Token-Schutzalgorithmus";
"06 09 60 86 48 01 65 02 01 01 08"	= "Fortezza-Token-Schutzalgorithmus";
"06 09 60 86 48 01 65 02 01 01 09"	= "SDNS-Schlüssel Verwaltungsalgorithmus";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Fortezza-Schlüssel Verwaltungsalgorithmus";
"06 09 60 86 48 01 65 02 01 01 0B"	= "SDNS-Schlüssel Verwaltungs- und Signaturalgorithmus";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Fortezza-Schlüssel Verwaltungs- und Signaturalgorithmus";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Suite A-Signaturalgorithmus";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Suite A-Vertraulichkeitsalgorithmus";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Suite A-Integritätsalgorithmus";
"06 09 60 86 48 01 65 02 01 01 10"	= "Suite A-Token-Schutzalgorithmus";
"06 09 60 86 48 01 65 02 01 01 11"	= "Suite A-Schlüssel Verwaltungsalgorithmus";
"06 09 60 86 48 01 65 02 01 01 12"	= "Suite A-Schlüssel Verwaltungs- und Signaturalgorithmus";
"06 09 60 86 48 01 65 02 01 01 13"	= "Algorithmus für aktualisierte Fortezza-Signatur";
"06 09 60 86 48 01 65 02 01 01 14"	= "Fortezza-Schlüsselverwaltung und Algorithmus für aktualisierte Signatur";
"06 09 60 86 48 01 65 02 01 01 15"	= "Aktualisierter Fortezza-Integritätsalgorithmus";
"06 09 60 86 48 01 65 02 01 01 16"	= "Schlüsselaustausch-Algorithmus";
"06 09 60 86 48 01 65 02 01 01 17"	= "Fortezza Wrap80-Algorithmus";
"06 09 60 86 48 01 65 02 01 01 18"	= "KEA (Key Encryption Algorithm)";

"06 09 60 86 48 01 65 02 01 02 01"	= "RFC 822-Nachrichtenformat";
"06 09 60 86 48 01 65 02 01 02 02"	= "Leerer Inhalt";
"06 09 60 86 48 01 65 02 01 02 03"	= "CSP Inhaltstyp";
"06 09 60 86 48 01 65 02 01 02 2A"	= "MSP Rev 3 Inhaltstyp";
"06 09 60 86 48 01 65 02 01 02 30"	= "MSP-Inhaltstyp";
"06 09 60 86 48 01 65 02 01 02 31"	= "MSP Rekey Agent Protokoll";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "MSP Rev 3.1 Inhaltstyp";
"06 09 60 86 48 01 65 02 01 02 48"	= "Textteil der weitergeleiteten MSP-Nachricht";
"06 09 60 86 48 01 65 02 01 02 49"	= "Parameter der weitergeleiteten MSP-Nachricht";
"06 09 60 86 48 01 65 02 01 02 50"	= "Textteil der weitergeleiteten CSP-Nachricht";
"06 09 60 86 48 01 65 02 01 02 51"	= "Parameter der weitergeleiteten CSP-Nachricht";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "SDNS-Sicherheitsrichtlinien";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaik-PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Sicherheitsrichtlinien";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Allgemein";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Standard-Sicherheitsrichtlinien";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "SDNS-Schlüssel Verwaltungszertifikat";
"06 09 60 86 48 01 65 02 01 05 02"	= "SDNS-Benutzer Signaturzertifikat";
"06 09 60 86 48 01 65 02 01 05 03"	= "SDNS-Schlüssel Verwaltungs- und Signaturzertifikat";
"06 09 60 86 48 01 65 02 01 05 04"	= "Fortezza-Schlüssel Verwaltungszertifikat";
"06 09 60 86 48 01 65 02 01 05 05"	= "Fortezza-Schlüssel Verwaltungs- und Signaturzertifikat";
"06 09 60 86 48 01 65 02 01 05 06"	= "Fortezza-Benutzer Signaturzertifikat";
"06 09 60 86 48 01 65 02 01 05 07"	= "Fortezza CA-Signaturzertifikat";
"06 09 60 86 48 01 65 02 01 05 08"	= "SDNS CA Signaturzertifikat";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Hilfsvektor";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Belegrichtlinien";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Mitgliedschaft";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Administratoren";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS Signatur CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS Signatur CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Liste für SDNS-Zertifikatswiderrufung";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Liste für Fortezza Zertifikatswiderrufung";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Exempted Address Processor";
"06 09 60 86 48 01 65 02 01 05 30"	= "Guard";
"06 09 60 86 48 01 65 02 01 05 31"	= "Unterstützte Algorithmen";
"06 09 60 86 48 01 65 02 01 05 32"	= "Suite A-Schlüssel Verwaltungszertifikat";
"06 09 60 86 48 01 65 02 01 05 33"	= "Suite A-Schlüssel Verwaltungs- und Signaturzertifikat";
"06 09 60 86 48 01 65 02 01 05 34"	= "Suite A-Benutzer Signaturzertifikat";
"06 09 60 86 48 01 65 02 01 05 35"	= "PRBAC-Information";
"06 09 60 86 48 01 65 02 01 05 36"	= "PRBAC CA-Beschränkungen";
"06 09 60 86 48 01 65 02 01 05 37"	= "Signatur- oder Schlüsselverwaltungsrechte";
"06 09 60 86 48 01 65 02 01 05 38"	= "Allgemeine Zugriffsrechte";
"06 09 60 86 48 01 65 02 01 05 39"	= "Etikettierte Attribute";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Datei mit Richtlinieninformation";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Datei mit Sicherheitsrichtlinien";
"06 09 60 86 48 01 65 02 01 05 3C"	= "CA-Klärungsbeschränkung";

"06 09 60 86 48 01 65 02 01 07 01"		= "CSP-Erweiterungen";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "ISSI-Sicherheitskategorien";
"06 09 60 86 48 01 65 02 01 08 02"		= "Standardmäßige Sicherheits-Zugriffsrechte";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Signaturrechte";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Schlüsselverwaltungsrechte";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Named-Tag-Set-Rechte";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "US Verteidigungsministerium Klasse 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "US Verteidigungsministerium Klasse 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "US Verteidigungsministerium Klasse 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "US Verteidigungsministerium Klasse 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "US Verteidigungsministerium PKI Klasse 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Test-Sicherheitsrichtlinien";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1-Sicherheitskategorien";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 Attributmenge null";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1-Attributmenge eins";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1-Attributmenge zwei";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "TSP2-Sicherheitskategorien";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2-Attributmenge null";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2-Attributmenge eins";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2-Attributmenge zwei";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kafka-Sicherheitskategorien";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka-Attributmenge Name 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka-Attributmenge Name 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka-Attributmenge Name 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Test CRL-Eintrag";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Bezeichnung";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "GAK-Richtlinien Identifizierung";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "FBCA Rudimentäre Richtlinien-Identifizierung";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "FBCA Standardrichtlinien-Identifizierung";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "FBCA Mittlere Richtlinien-Identifizierung";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "FBCA Hohe Richtlinien-Identifizierung";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "KRA-Schlüssel";
"06 08 60 86 48 01 65 03 02 03"			= "Erweiterungen";
"06 09 60 86 48 01 65 03 02 03 01"		= "Technik zur Schlüsselwiederherstellung";
"06 09 60 86 48 01 65 03 02 03 02"		= "Schlüsselwiederherstellung möglich";
"06 09 60 86 48 01 65 03 02 03 03"		= "Schlüsselwiederherstellung";
"06 08 60 86 48 01 65 03 02 04"			= "Schemata zur Schlüsselwiederherstellung";
"06 08 60 86 48 01 65 03 02 05"			= "CSOR GAK Erweiterung";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "NIST-Algorithmus";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Novell-Algorithmus";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 mit RSA-Verschlüsselung BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 mit RSA-Verschlüsselung BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 mit RSA-Verschlüsselung BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM Digest";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC mit SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC mit MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "MD4-Paket";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA-Verschlüsselung BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "NW-Kennwort";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "PKI-Attributstyp";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Sicherheitsattribute";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Vertrauensgrenze";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Netscape Objektidentifizierung";
"06 08 60 86 48 01 86 F8 42 01"		= "Netscape-Zertifikatserweiterung";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Netscape-Zertifikatstyp";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Netscape Basis-URL";
"06 09 60 86 48 01 86 F8 42 01 03"	= "Netscape Widerrufungs-URL";
"06 09 60 86 48 01 86 F8 42 01 04"	= "Netscape CA Widerrufungs-URL";
"06 09 60 86 48 01 86 F8 42 01 05"	= "Netscape CRL-Download-URL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "Netscape CA-Zertifikats-Download-URL";
"06 09 60 86 48 01 86 F8 42 01 07"	= "Netscape URL für Zertifikatserneuerung";
"06 09 60 86 48 01 86 F8 42 01 08"	= "Netscape CA Richtlinien-URL";
"06 09 60 86 48 01 86 F8 42 01 09"	= "Netscape Zertifikats-Homepage-URL";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Netscape Zertifikats-Einheitslogo";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Netscape Zertifikats-Benutzerbild";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Netscape SSL-Servername";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Netscape-Zertifikats-Kommentar";

"06 08 60 86 48 01 86 F8 42 02"		= "Netscape Datentyp";
"06 09 60 86 48 01 86 F8 42 02 01"	= "Bild/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "Bild/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "Text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Netscape-Zertifikatssequenz";
"06 09 60 86 48 01 86 F8 42 02 06"	= "Netscape-Zertifikats-URL";

"06 08 60 86 48 01 86 F8 42 03"			= "Netscape Verzeichnisobjekt-Identifizierung";
"06 09 60 86 48 01 86 F8 42 03 01"		= "LDAP-Definitionen";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Autolizenz";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Abteilungsnummer";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Personalnummer";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Art des Mitarbeiters";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Intranet-Organisationsperson";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Server Gated Crypto";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Unbekannte Verisign VPN-Erweiterung";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Unbekannte Verisign VPN-Erweiterung";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Verisign-Richtlinien Identifizierung";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Verisign CPS v1 Hinweis";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "Art des Inhalts";
"06 04 67 2A 00 00"	= "PAN-Daten";
"06 04 67 2A 00 01"	= "PAN-Token";
"06 04 67 2A 00 02"	= "Nur PAN";

"06 03 67 2A 01"	= "Nachrichterweiterung";
"06 03 67 2A 02"	= "Text Cell";
"06 04 67 2A 02 00"	= "Vollständiger Name";
"06 04 67 2A 02 01"	= "Vorname";
"06 04 67 2A 02 02"	= "Familienname";
"06 04 67 2A 02 03"	= "Geburtsname";
"06 04 67 2A 02 04"	= "Platzname";
"06 04 67 2A 02 05"	= "Identifizierungsnummer";
"06 04 67 2A 02 06"	= "Monat";
"06 04 67 2A 02 07"	= "Datum";
"06 04 67 2A 02 08"	= "Adresse";
"06 04 67 2A 02 09"	= "Telefon";
"06 04 67 2A 02 0A"	= "Betrag";
"06 04 67 2A 02 0B"	= "Accountnummer";
"06 04 67 2A 02 0C"	= "Kennwort";

"06 03 67 2A 03"		= "Kriterium";
"06 04 67 2A 03 00"		= "Zertifikat";
"06 05 67 2A 03 00 00"	= "Root Key Thumbprint";
"06 05 67 2A 03 00 01"	= "Weitere Richtlinien";

"06 03 67 2A 04"	= "Algorithmus";
"06 03 67 2A 05"	= "Richtlinie";
"06 04 67 2A 05 00"	= "Nullstelle";
"06 03 67 2A 06"	= "Modul";
"06 03 67 2A 07"	= "Zertifikatserweiterung";
"06 04 67 2A 07 00"	= "Hash-Root-Schlüssel";
"06 04 67 2A 07 01"	= "Zertifikatstyp";
"06 04 67 2A 07 02"	= "Handelsdaten";
"06 04 67 2A 07 03"	= "Kartenzertifikat erforderlich";
"06 04 67 2A 07 04"	= "Tunneling";
"06 04 67 2A 07 05"	= "SET-Erweiterung";
"06 04 67 2A 07 06"	= "SET-Kennzeichner";

"06 03 67 2A 08"	= "Marke";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Hersteller";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "National";
"06 05 67 2A 0A E2 00"	= "Japan";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Hash-Root-Schlüssel";
"06 04 86 8D 6F 03"	= "Zertifikatstyp";
"06 04 86 8D 6F 04"	= "Handelsdaten";
"06 04 86 8D 6F 05"	= "Kartenzertifikat erforderlich";
"06 04 86 8D 6F 06"	= "Tunneling";
"06 04 86 8D 6F 07"	= "SET-Kennzeichner";
"06 04 86 8D 6F 63"	= "SET-Daten";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Apple-Datensicherheit";

"06 08 2A 86 48 86 F7 63 64 01" = "Apple Trust-Richtlinienidentifizierung";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Apple iSign-Richtlinien";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Apple X.509 Standardrichtlinien";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Apple SSL-Richtlinien";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Apple-Richtlinien für das Erzeugen lokaler Zertifikate";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Apple-Richtlinien für das Erzeugen lokaler CSR-Zertifikate";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Apple CRL-Widerrufungsrichtlinien";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Apple OCSP-Widerrufungsrichtlinien";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Apple S/MIME-Richtlinien";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Apple erweiterbare Authentifizierungsrichtlinien";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Apple-Richtlinien für das Signieren von Softwareaktualisierungen";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Apple IPsec-Richtlinien";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Apple iChat-Richtlinien";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Apple-Richtlinien für das Signieren von Ressourcen";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Apple-Clientrichtlinien für Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Apple-Serverrichtlinien für Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Apple-Richtlinien für das Signieren von Code";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Apple-Richtlinien für das Signieren von Paketen";

"06 08 2A 86 48 86 F7 63 64 02" = "Apple Security Algorithm-Identifizierung";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "FEE (Fast Elliptic Encryption)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "ASC (Apple Secure Compression)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE mit MD5-Signatur";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE mit SHA-1-Signatur";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Apple FEED-Verschlüsselung";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple-FEED (Experimentell)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE mit ECDSA-Signatur";

"06 08 2A 86 48 86 F7 63 64 03" = "Apple .Mac-Zertifikatidentifizierung";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Apple .Mac-Zertifikatanfrage";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Anfrage für Apple .Mac-Identitätszertifikat";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Zertifikatanfrage zum Signieren von Apple .Mac-E‑Mail";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Zertifikatanfrage zum Verschlüsseln von Apple .Mac-E‑Mail";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Anfrage für Apple .Mac-Archivliste";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Anfrage für Apple .Mac-Archivspeicher";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Anfrage für Apple .Mac-Archivübertragung";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Anfrage für Apple .Mac-Archiventfernung";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Apple .Mac-Zertifikaterweiterung";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple .Mac-Identität";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Signieren von Apple .Mac-E‑Mail";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Verschlüsselung von Apple .Mac-E‑Mail";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Wert der Apple .Mac-Zertifikatanfrage";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Benutzername";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Kennwort";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Hostname";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Markierung erneuern";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Asynchrone Markierung";

"06 08 2A 86 48 86 F7 63 64 04" = "Erweiterte Schlüsselverwendung von Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Signieren von Apple Code";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Signieren von Apple Code (Entwicklung)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Apple-Signierung für Softwareaktualisierungen";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Signieren von Apple Code (Reserviert)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Apple Resource-Signierung";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Apple iChat-Signierung";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Apple iChat-Verschlüsselung";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Apple System-Identität";

"06 08 2A 86 48 86 F7 63 64 05" = "Apple Zertifikatsrichtlinien";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Apple Zertifikatsrichtlinien";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Apple .Mac-Zertifikatsrichtlinien";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Code-Signierung";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Intel CDSA-Sicherheit";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Intel CDSA-Sicherheitsformate";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "X.509v3-Zertifikatserweiterungen";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Private X.509v3-Zertifikatserweiterungen";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Signatur-Bitmap des Inhabers";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Bild des Inhabers";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "E‑Mail-Adresse des Inhabers";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Ausnahmen verwenden";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Intel CDSA-Sicherheitsalgorithmen";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 mit ECDSA";

/* end */
